Tekla.Structures.Drawing.PourBreak
The PourBreak class contains methods related to pour breaks.
A pour break is a drawing object derived from a model object.
It represents a drawing pour break that has a reference to the
actual pour break in the model database.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Drawing MyDrawing = new GADrawing();
View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
new AABB(new Point(), new Point(30000, 30000, 10000)));
PourBreak curBreak;
DrawingObjectEnumerator allObjects = curview.GetAllObjects();
while(allObjects.MoveNext())
{
if(allObjects.Current is PourBreak)
{
curBreak = allObjects.Current as PourBreak;
pourBreak.Attributes.VisibleLines = new LineTypeAttributes(LineTypes.DashDoubleDot,
DrawingColors.Blue);
curBreak.Modify(); /* Apply changes */
}
}
}
}

Tekla.Structures.Drawing.PourBreak.Attributes
The attributes of the pour break.
For more information see Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.

Tekla.Structures.Drawing.PourBreak.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PourBreak.#ctor(System.Boolean)
Create instance of pour break

Tekla.Structures.Drawing.PourBreak.#ctor
Create instance of pour break

Tekla.Structures.Drawing.PourBreak.Delete
Deletes the drawing pour break from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.PourBreak.Modify
Modifies the drawing pour break.
Returns: True on success.

Tekla.Structures.Drawing.PourBreak.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.PourBreak.Select
Selects the drawing pour break from the current drawing database.
Returns: True on success.